nickfox-taterli/openocd/contrib/loaders/flash/imxrt_firert_stub/third_party/drivers/Source/fsl_pxp.c
/*
 * The dither store size must be set to the same with the output buffer size,
 * otherwise the dither engine could not work.
 */
#if defined(PXP_DITHER_STORE_SIZE_CH0_OUT_WIDTH_MASK)
    base->DITHER_STORE_SIZE_CH0 = PXP_DITHER_STORE_SIZE_CH0_OUT_WIDTH((uint32_t)config->width - 1U) |
                                  PXP_DITHER_STORE_SIZE_CH0_OUT_HEIGHT((uint32_t)config->height - 1U);
#endif
}

/*!
 * brief Build a solid rectangle of given pixel value.
 *
 * param base PXP peripheral base address.
 * param outFormat output pixel format.
 * param value The value of the pixel to be filled in the rectangle in ARGB8888 format.
 * param width width of the rectangle.
 * param height height of the rectangle.
 * param pitch output pitch in byte.
 * param outAddr address of the memory to store the rectangle.
 */
void PXP_BuildRect(PXP_Type *base,
                   pxp_output_pixel_format_t outFormat,
                   uint32_t value,
                   uint16_t width,
                   uint16_t height,
                   uint16_t pitch,
                   uint32_t outAddr)
{
    /* Only support RGB format output. */
    assert((uint8_t)outFormat <= (uint8_t)kPXP_OutputPixelFormatRGB565);

    /* PS configuration */
#if (defined(FSL_FEATURE_PXP_V3) && FSL_FEATURE_PXP_V3) || (defined(FSL_FEATURE_PXP_V4) && FSL_FEATURE_PXP_V4)
    PXP_SetProcessSurfaceBackGroundColor(base, 0U, value);
#else
    PXP_SetProcessSurfaceBackGroundColor(base, value);
#endif
    PXP_SetProcessSurfacePosition(base, 0xFFFF, 0xFFFF, 0, 0);

    if ((outFormat == kPXP_OutputPixelFormatARGB8888) || (outFormat == kPXP_OutputPixelFormatARGB1555) ||
        (outFormat == kPXP_OutputPixelFormatARGB4444))
    {
        uint8_t alpha                         = (uint8_t)(value >> 24U);
        pxp_as_buffer_config_t asBufferConfig = {
            .pixelFormat = kPXP_AsPixelFormatARGB8888,
            .bufferAddr  = outAddr,
            .pitchBytes  = pitch,
        };
        PXP_SetAlphaSurfaceBufferConfig(base, &asBufferConfig);

        pxp_as_blend_config_t asBlendConfig = {
            .alpha = alpha, .invertAlpha = false, .alphaMode = kPXP_AlphaOverride, .ropMode = kPXP_RopMergeAs};
        PXP_SetAlphaSurfaceBlendConfig(base, &asBlendConfig);
#if (defined(FSL_FEATURE_PXP_V3) && FSL_FEATURE_PXP_V3) || (defined(FSL_FEATURE_PXP_V4) && FSL_FEATURE_PXP_V4)
        PXP_SetAlphaSurfaceOverlayColorKey(base, 0U, 0U, 0xFFFFFFFFUL);
        PXP_EnableAlphaSurfaceOverlayColorKey(base, 0U, true);
#else
        PXP_SetAlphaSurfaceOverlayColorKey(base, 0U, 0xFFFFFFFFUL);
        PXP_EnableAlphaSurfaceOverlayColorKey(base, true);
#endif
        PXP_SetAlphaSurfacePosition(base, 0, 0, width, height);
    }
    else
    {
        /* No need to configure AS for formats that do not have alpha value. */
        PXP_SetAlphaSurfacePosition(base, 0xFFFFU, 0xFFFFU, 0, 0);
    }

    /* Output config. */
    pxp_output_buffer_config_t outputBufferConfig;
    outputBufferConfig.pixelFormat    = outFormat;
    outputBufferConfig.interlacedMode = kPXP_OutputProgressive;
    outputBufferConfig.buffer0Addr    = outAddr;
    outputBufferConfig.buffer1Addr    = 0U;
    outputBufferConfig.pitchBytes     = pitch;
    outputBufferConfig.width          = width;
    outputBufferConfig.height         = height;
    PXP_SetOutputBufferConfig(base, &outputBufferConfig);

    PXP_EnableCsc1(base, false);

#if defined(FSL_FEATURE_PXP_V3) && FSL_FEATURE_PXP_V3
    PXP_SetPath(PXP, kPXP_Mux3SelectCsc1Engine);
    PXP_SetPath(PXP, kPXP_Mux8SelectAlphaBlending0);
    PXP_SetPath(PXP, kPXP_Mux11SelectMux8);
    PXP_SetPath(PXP, kPXP_Mux14SelectMux11);
    PXP_SetPath(PXP, kPXP_Mux0SelectNone);
    PXP_SetPath(PXP, kPXP_Mux6SelectNone);
    PXP_SetPath(PXP, kPXP_Mux9SelectNone);
    PXP_SetPath(PXP, kPXP_Mux12SelectNone);
#endif

    PXP_ClearStatusFlags(base, (uint32_t)kPXP_CompleteFlag);
    /* Start PXP. */
    PXP_Start(base);
    /* Wait for process complete. */
    while (0UL == ((uint32_t)kPXP_CompleteFlag & PXP_GetStatusFlags(base)))
    {
    }
}

/*!
 * brief Set the next command.
 *
 * The PXP supports a primitive ability to queue up one operation while the current
 * operation is running. Workflow:
 *
 * 1. Prepare the PXP register values except STAT, CSCCOEFn, NEXT in the memory
 * in the order they appear in the register map.
 * 2. Call this function sets the new operation to PXP.
 * 3. There are two methods to check whether the PXP has loaded the new operation.
 * The first method is using ref PXP_IsNextCommandPending. If there is new operation
 * not loaded by the PXP, this function returns true. The second method is checking
 * the flag ref kPXP_CommandLoadFlag, if command loaded, this flag asserts. User
 * could enable interrupt ref kPXP_CommandLoadInterruptEnable to get the loaded
 * signal in interrupt way.
 * 4. When command loaded by PXP, a new command could be set using this function.
 *
 * param base PXP peripheral base address.
 * param commandAddr Address of the new command.
 */
void PXP_SetNextCommand(PXP_Type *base, void *commandAddr)
{
    pxp_pvoid_u32_t addr;

    /* Make sure commands have been saved to memory. */
    __DSB();

    addr.pvoid = commandAddr;

    base->NEXT = PXP_ADDR_CPU_2_IP(addr.u32) & PXP_NEXT_POINTER_MASK;
}

#if !(defined(FSL_FEATURE_PXP_HAS_NO_CSC2) && FSL_FEATURE_PXP_HAS_NO_CSC2)
/*!
 * brief Set the CSC2 configuration.
 *
 * The CSC2 module receives pixels in any color space and can convert the pixels
 * into any of RGB, YUV, or YCbCr color spaces. The output pixels are passed
 * onto the LUT and rotation engine for further processing
 *
 * param base PXP peripheral base address.
 * param config Pointer to the configuration.
 */
void PXP_SetCsc2Config(PXP_Type *base, const pxp_csc2_config_t *config)
{
    assert(NULL != config);
    uint32_t tempReg;

    base->CSC2_CTRL = (base->CSC2_CTRL & ~PXP_CSC2_CTRL_CSC_MODE_MASK) | PXP_CSC2_CTRL_CSC_MODE(config->mode);

