nickfox-taterli/openocd/contrib/loaders/flash/imxrt_firert_stub/third_party/drivers/Source/fsl_pxp.c
    uint32_t cfaArrayRegAddr = (uint32_t) & (base->CFA_ARRAY0);
    uint32_t cfaValueAddr    = (uint32_t)(config->cfaValue);
    uint8_t wordCount        = 0U; /* How many 32-bit word does the CFA array need. */

    base->CFA_CTRL = PXP_CFA_CTRL_CFA_ARRAY_HSIZE((uint32_t)config->arrayWidth) |
                     PXP_CFA_CTRL_CFA_ARRAY_VSIZE((uint32_t)config->arrayHeight) |
                     PXP_CFA_CTRL_CFA_IN_RGB444((uint32_t)config->pixelInFormat) |
                     PXP_CFA_CTRL_CFA_BYPASS((uint32_t)config->bypass);
    base->CFA_SIZE = ((uint32_t)(config->totalWidth) << 16U) | (uint32_t)(config->totalHeight);

    /* Calculate how many registers to configure. If the value is not divisible then add 1 no matter the remainder. */
    wordCount = (config->arrayWidth * config->arrayHeight * 2U + 31U) / 32U;

    /* Configure the CFA array value. */
    for (uint8_t i = 0U; i < wordCount; i++)
    {
        *(uint32_t *)cfaArrayRegAddr = *(uint32_t *)cfaValueAddr;
        cfaArrayRegAddr += 0x10U;
        cfaValueAddr += 4U;
    }

    return kStatus_Success;
}

/*!
 * brief Configures histogram engine.
 *
 * param base PXP peripheral base address.
 * param num instance number.
 * param config pointer to the configuration structure.
 * retval kStatus_Success Successfully configured the engine.
 * retval kStatus_InvalidArgument Invalid argument.
 */
status_t PXP_SetHistogramConfig(PXP_Type *base, uint8_t num, const pxp_histogram_config_t *config)
{
    assert(NULL != config);
    /* The LUT value width can not be larger than 6. */
    if ((uint32_t)config->lutValueWidth > 6U)
    {
        return kStatus_InvalidArgument;
    }

    uint32_t ctrlReg = 0U;
    uint32_t maskReg = 0U;

    ctrlReg = PXP_HIST_A_CTRL_ENABLE((uint32_t)config->enable) |
              PXP_HIST_A_CTRL_PIXEL_OFFSET((uint32_t)config->lutValueOffset) |
              PXP_HIST_A_CTRL_PIXEL_WIDTH((uint32_t)config->lutValueWidth);
    maskReg = PXP_HIST_A_MASK_MASK_EN((uint32_t)config->enableMask) |
              PXP_HIST_A_MASK_MASK_MODE((uint32_t)config->condition) |
              PXP_HIST_A_MASK_MASK_OFFSET((uint32_t)config->maskOffset) |
              PXP_HIST_A_MASK_MASK_WIDTH((uint32_t)config->maskWidth) |
              PXP_HIST_A_MASK_MASK_VALUE0((uint32_t)config->maskValue0) |
              PXP_HIST_A_MASK_MASK_VALUE1((uint32_t)config->maskValue1);

    switch (num)
    {
        case 0:
            base->HIST_A_CTRL     = ctrlReg;
            base->HIST_A_MASK     = maskReg;
            base->HIST_A_BUF_SIZE = ((uint32_t)(config->totalHeight) << 16U) | (uint32_t)config->totalWidth;
            break;

        case 1:
            base->HIST_B_CTRL     = ctrlReg;
            base->HIST_B_MASK     = maskReg;
            base->HIST_B_BUF_SIZE = ((uint32_t)(config->totalHeight) << 16U) | (uint32_t)config->totalWidth;
            break;

        default:
            /* Only 2 histogram instances are supported. */
            assert(false);
            break;
    }

    /* Only configure the histogram params when user choose to, otherwise use the registers' reset value as default. */
    if (config->pParamValue != NULL)
    {
        uint32_t paramRegAddr   = (uint32_t) & (base->HIST2_PARAM);
        uint32_t paramValueAddr = (uint32_t)(config->pParamValue);

        /* Configure the 2-level histogram params. */
        *(uint32_t *)paramRegAddr = (uint32_t)(*(uint8_t *)(paramValueAddr)) | ((uint32_t)(*(uint8_t *)((paramValueAddr) + 1U)) << 8U);
        paramRegAddr += 0x10U;
        paramValueAddr += 2U;

        /* Configure the 4/8/16/32-level histogram params. */
        for (uint8_t i = 0U; i < ((4U + 8U + 16U + 32U) / 4U); i++)
        {
            *(uint32_t *)paramRegAddr = PXP_COMBINE_BYTE_TO_WORD(paramValueAddr);
            paramRegAddr += 0x10U;
            paramValueAddr += 4U;
        }
    }

    return kStatus_Success;
}

/*!
 * brief Gets the results of histogram mask operation.
 *
 * param base PXP peripheral base address.
 * param num instance number.
 * param result pointer to the result structure.
 */
void PXP_GetHistogramMaskResult(PXP_Type *base, uint8_t num, pxp_histogram_mask_result_t *result)
{
    assert(NULL != result);
    /* Initializes the result structure to zero. */
    (void)memset(result, 0, sizeof(*result));

    switch (num)
    {
        case 0:
            result->pixelCount = base->HIST_A_TOTAL_PIXEL;
            result->minX       = (uint16_t)base->HIST_A_ACTIVE_AREA_X;
            result->maxX       = (uint16_t)(base->HIST_A_ACTIVE_AREA_X >> 16U);
            result->minY       = (uint16_t)base->HIST_A_ACTIVE_AREA_Y;
            result->maxY       = (uint16_t)(base->HIST_A_ACTIVE_AREA_Y >> 16U);
            result->lutlist    = (uint64_t)base->HIST_A_RAW_STAT0 | ((uint64_t)base->HIST_A_RAW_STAT1 << 32U);
            break;

        case 1:
            result->pixelCount = base->HIST_B_TOTAL_PIXEL;
            result->minX       = (uint16_t)base->HIST_B_ACTIVE_AREA_X;
            result->maxX       = (uint16_t)(base->HIST_B_ACTIVE_AREA_X >> 16U);
            result->minY       = (uint16_t)base->HIST_B_ACTIVE_AREA_Y;
            result->maxY       = (uint16_t)(base->HIST_B_ACTIVE_AREA_Y >> 16U);
            result->lutlist    = (uint64_t)base->HIST_B_RAW_STAT0 | ((uint64_t)base->HIST_B_RAW_STAT1 << 32U);
            break;

        default:
            /* Only 2 histogram instances are supported. */
            assert(false);
            break;
    }
}

/*!
 * brief Initializes the WFE-A engine for waveform process.
 *
 * param base PXP peripheral base address.
 * param ditherHandshake true to enable handshake mode with upstream dither store engine.
 */
void PXP_WfeaInit(PXP_Type *base, bool ditherHandshake)
{
    /* FETCH engine configuration, user fetch buffer1 for Y4 data buffer and buffer2 for working buffer. */
    /* Enable buffer1&2 fetch. 2 bytes in each pixel for the buffer2.
       Other default configurations: fetch data from external axi bus, normal(not hanshake or by pass) mode, burst
       length 4, normal border pixels select(not sw reg mode), 1 line fetch, done IRQ disabled. */
    base->WFA_FETCH_CTRL = PXP_WFA_FETCH_CTRL_BF1_EN(1UL) | PXP_WFA_FETCH_CTRL_BF2_EN(1UL) |
                           PXP_WFA_FETCH_CTRL_BF2_BYTES_PP(1UL) |
                           PXP_WFA_FETCH_CTRL_BF1_HSK_MODE((uint32_t)ditherHandshake);
    /* Select pixel from bufer 2, set the right/left bit position on the original pixel as 0/3 */
    /* Other default configurations: x/y offset=0, positive offset. */
    base->WFA_ARRAY_PIXEL0_MASK = PXP_WFA_ARRAY_PIXEL0_MASK_BUF_SEL(1UL) | PXP_WFA_ARRAY_PIXEL0_MASK_L_OFS(3UL);
    /* Select pixel from bufer 2, set the right/left bit position on the original pixel as 4/7 */
    base->WFA_ARRAY_PIXEL1_MASK = PXP_WFA_ARRAY_PIXEL0_MASK_BUF_SEL(1UL) | PXP_WFA_ARRAY_PIXEL0_MASK_H_OFS(4UL) |
                                  PXP_WFA_ARRAY_PIXEL0_MASK_L_OFS(7UL);
    /* Select pixel from bufer 2, set the right/left bit position on the original pixel as 8/9 */
    base->WFA_ARRAY_PIXEL2_MASK = PXP_WFA_ARRAY_PIXEL0_MASK_BUF_SEL(1UL) | PXP_WFA_ARRAY_PIXEL0_MASK_H_OFS(8UL) |
                                  PXP_WFA_ARRAY_PIXEL0_MASK_L_OFS(9UL);
    /* Select pixel from bufer 2, set the right/left bit position on the original pixel as 10/15 */
    base->WFA_ARRAY_PIXEL3_MASK = PXP_WFA_ARRAY_PIXEL0_MASK_BUF_SEL(1UL) | PXP_WFA_ARRAY_PIXEL0_MASK_H_OFS(10UL) |
                                  PXP_WFA_ARRAY_PIXEL0_MASK_L_OFS(15UL);
    /* Select pixel from bufer 1, set the right/left bit position on the original pixel as 4/7 */
    base->WFA_ARRAY_PIXEL4_MASK = PXP_WFA_ARRAY_PIXEL0_MASK_H_OFS(4UL) | PXP_WFA_ARRAY_PIXEL0_MASK_L_OFS(7UL);
    /* Software define flag0=1, other flags 1~15 =0 */
    base->WFA_ARRAY_REG2 = 1UL;

    /* STORE engine configuration */
    /* Channel 0 y4, channel 1 wb */
    /* Enable channel 0, store data to memory, select low 32 bit shift out data to pack, enable combine 2 channel. */
    /* Other default configurations: Arbitration disable(if using 2 channels, will output 2 axi bus sets), 8 bytes in a
       burst, fill data mode disable, block mode disable. */
    base->WFE_A_STORE_CTRL_CH0 = PXP_WFE_A_STORE_CTRL_CH0_CH_EN(1UL) | PXP_WFE_A_STORE_CTRL_CH0_STORE_MEMORY_EN(1UL) |
                                 PXP_WFE_A_STORE_CTRL_CH0_PACK_IN_SEL(1UL) |
                                 PXP_WFE_A_STORE_CTRL_CH0_COMBINE_2CHANNEL(1UL);
    /* Enable channel 1, store data to memory, select low 32 bit shift out data to pack, 16 bytes in a write burst. */
    base->WFE_A_STORE_CTRL_CH1 = PXP_WFE_A_STORE_CTRL_CH1_CH_EN(1UL) | PXP_WFE_A_STORE_CTRL_CH1_STORE_MEMORY_EN(1UL) |
                                 PXP_WFE_A_STORE_CTRL_CH1_PACK_IN_SEL(1UL) | PXP_WFE_A_STORE_CTRL_CH1_WR_NUM_BYTES(1UL);
    /* 8 Bpp, disable YUV planes, disable shift bypass. */
    base->WFE_A_STORE_SHIFT_CTRL_CH0 = 0UL;
    /* 16 Bpp, disable YUV planes, disable shift bypass. */
    base->WFE_A_STORE_SHIFT_CTRL_CH1 = PXP_WFE_A_STORE_SHIFT_CTRL_CH1_OUTPUT_ACTIVE_BPP(1);
    base->WFE_A_STORE_FILL_DATA_CH0  = 0UL;
    /* 8 data masks, mask 0-7. Only use mask 0-4 */
    /* mask 0: 0xF << 32; mask 1: 0xF00 << 28; mask 2: 0x0 << 24; mask 3: 0x3F00'0000 << 18; mask 4: 0xF'0000'0000 >> 28
     */
    base->WFE_A_STORE_D_MASK0_H_CH0 = 0UL;
    base->WFE_A_STORE_D_MASK0_L_CH0 = PXP_WFE_A_STORE_D_MASK0_L_CH0_D_MASK0_L_CH0(0xfUL); /* fetch CP */
    base->WFE_A_STORE_D_MASK1_H_CH0 = 0UL;
    base->WFE_A_STORE_D_MASK1_L_CH0 = PXP_WFE_A_STORE_D_MASK1_L_CH0_D_MASK1_L_CH0(0xf00UL); /* fetch NP */
    base->WFE_A_STORE_D_MASK2_H_CH0 = 0UL;
    base->WFE_A_STORE_D_MASK2_L_CH0 = 0UL;
    base->WFE_A_STORE_D_MASK3_H_CH0 = 0UL;
    base->WFE_A_STORE_D_MASK3_L_CH0 = PXP_WFE_A_STORE_D_MASK3_L_CH0_D_MASK3_L_CH0(0x3f000000UL); /* fetch LUT */
    base->WFE_A_STORE_D_MASK4_H_CH0 = PXP_WFE_A_STORE_D_MASK4_H_CH0_D_MASK4_H_CH0(0xfUL);
    base->WFE_A_STORE_D_MASK4_L_CH0 = 0UL; /* fetch Y4 */
    base->WFE_A_STORE_D_SHIFT_L_CH0 =
        PXP_WFE_A_STORE_D_SHIFT_L_CH0_D_SHIFT_WIDTH0(32UL) | PXP_WFE_A_STORE_D_SHIFT_L_CH0_D_SHIFT_FLAG0(1UL) |
        PXP_WFE_A_STORE_D_SHIFT_L_CH0_D_SHIFT_WIDTH1(28UL) | PXP_WFE_A_STORE_D_SHIFT_L_CH0_D_SHIFT_FLAG1(1UL) |
        PXP_WFE_A_STORE_D_SHIFT_L_CH0_D_SHIFT_WIDTH2(24UL) | PXP_WFE_A_STORE_D_SHIFT_L_CH0_D_SHIFT_FLAG2(1UL) |
        PXP_WFE_A_STORE_D_SHIFT_L_CH0_D_SHIFT_WIDTH3(18UL) | PXP_WFE_A_STORE_D_SHIFT_L_CH0_D_SHIFT_FLAG3(1UL);
    base->WFE_A_STORE_D_SHIFT_H_CH0 = PXP_WFE_A_STORE_D_SHIFT_H_CH0_D_SHIFT_WIDTH4(28UL);

    /* 8 flag masks, mask 0-7. Only use mask 0-3 */
    /* mask 0: 0x1 << 1; mask 1: 0x2 >> 1; mask 2: 0x4 << 38; mask 3: 0x8 << 38 */
    /* Switch flag bit 0&1, bit 2&3 << 38 */
    base->WFE_A_STORE_F_MASK_H_CH0 = 0UL;
    base->WFE_A_STORE_F_MASK_L_CH0 =
        PXP_WFE_A_STORE_F_MASK_L_CH0_F_MASK0(0x1UL) | PXP_WFE_A_STORE_F_MASK_L_CH0_F_MASK1(0x2UL) |
        PXP_WFE_A_STORE_F_MASK_L_CH0_F_MASK2(0x4UL) | PXP_WFE_A_STORE_F_MASK_L_CH0_F_MASK3(0x8UL);
    base->WFE_A_STORE_F_SHIFT_H_CH0 = 0UL;
    base->WFE_A_STORE_F_SHIFT_L_CH0 =
        PXP_WFE_A_STORE_F_SHIFT_L_CH0_F_SHIFT_WIDTH0(1UL) | PXP_WFE_A_STORE_F_SHIFT_L_CH0_F_SHIFT_FLAG0(1UL) |
        PXP_WFE_A_STORE_F_SHIFT_L_CH0_F_SHIFT_WIDTH1(1UL) | PXP_WFE_A_STORE_F_SHIFT_L_CH0_F_SHIFT_FLAG1(0UL) |
        PXP_WFE_A_STORE_F_SHIFT_L_CH0_F_SHIFT_WIDTH2(32UL + 6UL) | PXP_WFE_A_STORE_F_SHIFT_L_CH0_F_SHIFT_FLAG2(1UL) |
        PXP_WFE_A_STORE_F_SHIFT_L_CH0_F_SHIFT_WIDTH3(32UL + 6UL) | PXP_WFE_A_STORE_F_SHIFT_L_CH0_F_SHIFT_FLAG3(1UL);

    /* Enable and bypass the ALU process. */
    base->ALU_A_INST_ENTRY = 0UL;
    base->ALU_A_PARAM      = 0UL;
    base->ALU_A_CONFIG     = 0UL;
    base->ALU_A_LUT_CONFIG = 0UL;
    base->ALU_A_LUT_DATA0  = 0UL;
    base->ALU_A_LUT_DATA1  = 0UL;
    base->ALU_A_CTRL       = PXP_ALU_A_CTRL_BYPASS(1UL) | PXP_ALU_A_CTRL_ENABLE(1UL);

    /* WFE A */
    base->WFE_A_STAGE1_MUX0  = 0x3F3F0303UL;
    base->WFE_A_STAGE1_MUX1  = 0x0C00000CUL;
    base->WFE_A_STAGE1_MUX2  = 0x01040000UL;
    base->WFE_A_STAGE1_MUX3  = 0x0A0A0904UL;
    base->WFE_A_STAGE1_MUX4  = 0x00000B0BUL;
    base->WFE_A_STAGE2_MUX0  = 0x1800280EUL;
    base->WFE_A_STAGE2_MUX1  = 0x00280E01UL;
    base->WFE_A_STAGE2_MUX2  = 0x280E0118UL;
    base->WFE_A_STAGE2_MUX3  = 0x00011800UL;
    base->WFE_A_STAGE2_MUX4  = 0UL;
    base->WFE_A_STAGE2_MUX5  = 0x1800280EUL;
    base->WFE_A_STAGE2_MUX6  = 0x00280E01UL;
    base->WFE_A_STAGE2_MUX7  = 0x1A0E0118UL;
    base->WFE_A_STAGE2_MUX8  = 0x1B012911UL;
    base->WFE_A_STAGE2_MUX9  = 0x00002911UL;
    base->WFE_A_STAGE2_MUX10 = 0UL;
    base->WFE_A_STAGE2_MUX11 = 0UL;
    base->WFE_A_STAGE2_MUX12 = 0UL;
    base->WFE_A_STAGE3_MUX0  = 0x07060504UL;
    base->WFE_A_STAGE3_MUX1  = 0x3F3F3F08UL;
    base->WFE_A_STAGE3_MUX2  = 0x03020100UL;
    base->WFE_A_STAGE3_MUX3  = 0x3F3F3F3FUL;

    /* WFE_A_STG1_8X1_OUT0_0/1 is used to store LUT occupation status */
    /* Set LUT64-255 to occupied since we only have 64 LUTs in EPDC */
    base->WFE_A_STG1_8X1_OUT0_2 = 0xFFFFFFFFUL;
    base->WFE_A_STG1_8X1_OUT0_3 = 0xFFFFFFFFUL;
    base->WFE_A_STG1_8X1_OUT0_4 = 0xFFFFFFFFUL;
    base->WFE_A_STG1_8X1_OUT0_5 = 0xFFFFFFFFUL;
    base->WFE_A_STG1_8X1_OUT0_6 = 0xFFFFFFFFUL;
    base->WFE_A_STG1_8X1_OUT0_7 = 0xFFFFFFFFUL;
    /* OUT1.2.3 LUT0-255 */
    base->WFE_A_STG1_8X1_OUT1_0 = 0UL;
    base->WFE_A_STG1_8X1_OUT1_1 = 0UL;
    base->WFE_A_STG1_8X1_OUT1_2 = 0UL;
    base->WFE_A_STG1_8X1_OUT1_3 = 0UL;
    base->WFE_A_STG1_8X1_OUT1_4 = 0UL;
    base->WFE_A_STG1_8X1_OUT1_5 = 0UL;
    base->WFE_A_STG1_8X1_OUT1_6 = 0UL;
    base->WFE_A_STG1_8X1_OUT1_7 = 0UL;
    base->WFE_A_STG1_8X1_OUT2_0 = 0UL;
    base->WFE_A_STG1_8X1_OUT2_1 = 0UL;
    base->WFE_A_STG1_8X1_OUT2_2 = 0UL;
    base->WFE_A_STG1_8X1_OUT2_3 = 0UL;
    base->WFE_A_STG1_8X1_OUT2_4 = 0UL;
    base->WFE_A_STG1_8X1_OUT2_5 = 0UL;
    base->WFE_A_STG1_8X1_OUT2_6 = 0UL;
    base->WFE_A_STG1_8X1_OUT2_7 = 0UL;
    base->WFE_A_STG1_8X1_OUT3_0 = 0UL;
    base->WFE_A_STG1_8X1_OUT3_1 = 0UL;
    base->WFE_A_STG1_8X1_OUT3_2 = 0UL;
    base->WFE_A_STG1_8X1_OUT3_3 = 0UL;
    base->WFE_A_STG1_8X1_OUT3_4 = 0UL;
    base->WFE_A_STG1_8X1_OUT3_5 = 0UL;
    base->WFE_A_STG1_8X1_OUT3_6 = 0UL;
    base->WFE_A_STG1_8X1_OUT3_7 = 0UL;
    /* LUTOUT0-31 for OUT0-3.
       The 5x6 LUT output value for input value n. This output value determines which input to select (flag, data). */
    base->WFE_A_STG2_5X6_OUT0_0 = 0x04040404UL;
    base->WFE_A_STG2_5X6_OUT0_1 = 0x04040404UL;
    base->WFE_A_STG2_5X6_OUT0_2 = 0x04050505UL;
    base->WFE_A_STG2_5X6_OUT0_3 = 0x04040404UL;
    base->WFE_A_STG2_5X6_OUT0_4 = 0x04040404UL;
    base->WFE_A_STG2_5X6_OUT0_5 = 0x04040404UL;
    base->WFE_A_STG2_5X6_OUT0_6 = 0x04040404UL;
    base->WFE_A_STG2_5X6_OUT0_7 = 0x04040404UL;
    base->WFE_A_STG2_5X6_OUT1_0 = 0x05050505UL;
    base->WFE_A_STG2_5X6_OUT1_1 = 0x05050505UL;
    base->WFE_A_STG2_5X6_OUT1_2 = 0x05080808UL;
    base->WFE_A_STG2_5X6_OUT1_3 = 0x05050505UL;
    base->WFE_A_STG2_5X6_OUT1_4 = 0x05050505UL;
    base->WFE_A_STG2_5X6_OUT1_5 = 0x05050505UL;
    base->WFE_A_STG2_5X6_OUT1_6 = 0x05050505UL;
    base->WFE_A_STG2_5X6_OUT1_7 = 0x05050505UL;
    base->WFE_A_STG2_5X6_OUT2_0 = 0x07070707UL;
    base->WFE_A_STG2_5X6_OUT2_1 = 0x07070707UL;
    base->WFE_A_STG2_5X6_OUT2_2 = 0x070C0C0CUL;
    base->WFE_A_STG2_5X6_OUT2_3 = 0x07070707UL;
    base->WFE_A_STG2_5X6_OUT2_4 = 0X0F0F0F0FUL;
    base->WFE_A_STG2_5X6_OUT2_5 = 0X0F0F0F0FUL;
    base->WFE_A_STG2_5X6_OUT2_6 = 0X0F0F0F0FUL;
    base->WFE_A_STG2_5X6_OUT2_7 = 0X0F0F0F0FUL;
    base->WFE_A_STG2_5X6_OUT3_0 = 0UL;
    base->WFE_A_STG2_5X6_OUT3_1 = 0UL;
    base->WFE_A_STG2_5X6_OUT3_2 = 0UL;
    base->WFE_A_STG2_5X6_OUT3_3 = 0UL;
    base->WFE_A_STG2_5X6_OUT3_4 = 0UL;
    base->WFE_A_STG2_5X6_OUT3_5 = 0UL;
    base->WFE_A_STG2_5X6_OUT3_6 = 0UL;
    base->WFE_A_STG2_5X6_OUT3_7 = 0UL;
    /* MASK0-3, 5 bits each mask.
       Each set mask bit enables one of the corresponding flag input bits. There is one mask per 5x6 LUT. */
    base->WFE_A_STAGE2_5X6_MASKS_0 = 0x001F1F1FUL;
    /* MUXADDR 0-3, 6 bits each.
       Each Address specifies the MUX position in the MUX array. There is one MUXADDR per 5x6 LUT.*/
    base->WFE_A_STAGE2_5X6_ADDR_0 = 0x3f030100UL;
    /* Flag of LUTOUT0-31 for OUT0-3.
       The 5x1 LUT output value for input value n. This output value results in a flag that is added to the flag array.
     */
    base->WFE_A_STG2_5X1_OUT0 = 0x00000700UL;
    base->WFE_A_STG2_5X1_OUT1 = 0x00007000UL;
    base->WFE_A_STG2_5X1_OUT2 = 0x0000A000UL;
    base->WFE_A_STG2_5X1_OUT3 = 0x000000C0UL;
    /* MASK0-3, 5 bits each mask.
       Each set mask bit enables one of the corresponding flag input bits. There is one mask per 5x1 LUT. */
    base->WFE_A_STG2_5X1_MASKS = 0x071F1F1FUL;
}

/*!
 * brief Configure the WFE-A engine
 *
 * param base PXP peripheral base address.
 * param config pointer to the configuration structure.
 */
void PXP_SetWfeaConfig(PXP_Type *base, const pxp_wfea_engine_config_t *config)
{
    /* Fetch */
    base->WFA_FETCH_BUF1_ADDR  = config->y4Addr;
    base->WFA_FETCH_BUF1_PITCH = config->updatePitch;
    base->WFA_FETCH_BUF1_SIZE  = PXP_WFA_FETCH_BUF1_SIZE_BUF_HEIGHT((uint32_t)config->updateHeight - 1UL) |
                                PXP_WFA_FETCH_BUF1_SIZE_BUF_WIDTH((uint32_t)config->updateWidth - 1UL);
    base->WFA_FETCH_BUF1_CORD  = 0UL;
    base->WFA_FETCH_BUF2_ADDR  = config->wbAddr;
    base->WFA_FETCH_BUF2_PITCH = (uint32_t)config->resX * 2U; /* 2 bytes per pixel */
    base->WFA_FETCH_BUF2_SIZE  = PXP_WFA_FETCH_BUF1_SIZE_BUF_HEIGHT((uint32_t)config->updateHeight - 1UL) |
                                PXP_WFA_FETCH_BUF1_SIZE_BUF_WIDTH((uint32_t)config->updateWidth - 1UL);
    base->WFA_FETCH_BUF2_CORD =
        PXP_WFA_FETCH_BUF2_CORD_YCORD((uint32_t)config->ulcY) | PXP_WFA_FETCH_BUF2_CORD_XCORD((uint32_t)config->ulcX);

    /* Store */
    base->WFE_A_STORE_SIZE_CH0 = PXP_WFE_A_STORE_SIZE_CH0_OUT_WIDTH((uint32_t)config->updateWidth - 1UL) |
                                 PXP_WFE_A_STORE_SIZE_CH0_OUT_HEIGHT((uint32_t)config->updateHeight - 1UL);
    base->WFE_A_STORE_SIZE_CH1 = PXP_WFE_A_STORE_SIZE_CH0_OUT_WIDTH((uint32_t)config->updateWidth - 1UL) |
                                 PXP_WFE_A_STORE_SIZE_CH0_OUT_HEIGHT((uint32_t)config->updateHeight - 1UL);
    /* Channel 1: 2 byte per pixel. */
    base->WFE_A_STORE_PITCH = PXP_WFE_A_STORE_PITCH_CH0_OUT_PITCH((uint32_t)config->resX) |
                              PXP_WFE_A_STORE_PITCH_CH1_OUT_PITCH((uint32_t)config->resX * 2U);
    base->WFE_A_STORE_ADDR_0_CH0 = PXP_WFE_A_STORE_ADDR_0_CH0_OUT_BASE_ADDR0(config->y4cAddr);
    base->WFE_A_STORE_ADDR_1_CH0 = 0U;
    /* Channel 1: 2 bytes per pixel. */
    base->WFE_A_STORE_ADDR_0_CH1 = PXP_WFE_A_STORE_ADDR_0_CH1_OUT_BASE_ADDR0(
        (uint32_t)config->wbAddr + ((uint32_t)config->ulcX + (uint32_t)config->ulcY * (uint32_t)config->resX) * 2UL);
    base->WFE_A_STORE_ADDR_1_CH1 = 0U;

    /* ALU */
    base->ALU_A_BUF_SIZE = PXP_ALU_A_BUF_SIZE_BUF_WIDTH((uint32_t)config->updateWidth) |
                           PXP_ALU_A_BUF_SIZE_BUF_HEIGHT((uint32_t)config->updateHeight);

    /* WFE */
    /* Height and width of the updete region */
    base->WFE_A_DIMENSIONS =
        PXP_WFE_A_DIMENSIONS_WIDTH(config->updateWidth) | PXP_WFE_A_DIMENSIONS_HEIGHT(config->updateHeight);
    /* The distance from the frame origin to the update region origin in the X/Y direction. */
    base->WFE_A_OFFSET = PXP_WFE_A_OFFSET_X_OFFSET(config->ulcX) | PXP_WFE_A_OFFSET_Y_OFFSET(config->ulcY);
    /* val3,val2=0, val1=F, val0=lutNum */
    base->WFE_A_SW_DATA_REGS = (config->lutNum & 0x000000FFUL) | 0x00000F00UL;
    /* val3,val2=0, val1=0(disable reagl/-d), val0=partial(1)full(0) */
    base->WFE_A_SW_FLAG_REGS = ((uint32_t)(!config->fullUpdateEnable) | (0U << 1U));
    /* Enable and reset WFE-A state. Disable register of ALU inside waveform as default. */
    base->WFE_A_CTRL = PXP_WFE_A_CTRL_ENABLE(1UL) | PXP_WFE_A_CTRL_SW_RESET(1UL);

    if (config->alphaEnable)
    {
        base->WFA_ARRAY_FLAG0_MASK = 0U;
    }
    else
    {
        base->WFA_ARRAY_FLAG0_MASK = PXP_WFA_ARRAY_FLAG0_MASK_BUF_SEL(2UL);
    }

    /* disable CH1 when only doing detection */
    if (config->detectionOnly)
    {
        base->WFE_A_STORE_CTRL_CH1 &= ~PXP_WFE_A_STORE_CTRL_CH1_CH_EN(1UL);
    }
    else
    {
        base->WFE_A_STORE_CTRL_CH1 |= PXP_WFE_A_STORE_CTRL_CH1_CH_EN(1UL);
    }
    /* Enable engine */
    base->CTRL_SET = PXP_CTRL_ENABLE_WFE_A(1UL);
}
#endif /* FSL_FEATURE_PXP_V3 */

#if PXP_USE_PATH
/*!
 * brief Sets the path for one of the MUX
 *
 * param base PXP peripheral base address.
 * param path the path configuration for one of the mux.
 */
void PXP_SetPath(PXP_Type *base, pxp_path_t path)
{
    volatile uint32_t *pathReg = NULL;
    uint32_t mux = PXP_GET_MUX_FROM_PATH((uint32_t)path);
    uint32_t sel = PXP_GET_SEL_FROM_PATH((uint32_t)path);

    if (mux > 15U)
    {
#if !(defined(FSL_FEATURE_PXP_V4) && FSL_FEATURE_PXP_V4)
        /* FSL_FEATURE_PXP_V4 do not support DATA_PATH_CTRL1 */
        pathReg = &(base->DATA_PATH_CTRL1);
        mux -= 15U;
#endif
    }
    else
    {
        pathReg = &(base->DATA_PATH_CTRL0);
    }

    /* Convert mux to the register shift. */
    mux *= 2U;
    *pathReg = (*pathReg & ~(3UL << mux)) | (sel << mux);
}
#endif /* PXP_USE_PATH */
